ssloy/mathfun/CartPendulum/src/STM32VLDISCOVERY/Src/main.c
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

#include <stdlib.h>
#include <string.h>
#include <math.h>

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

DAC_HandleTypeDef hdac;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim6;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

volatile uint8_t system_task=0;

volatile int32_t capture4=0, capture4_prev=0, encoder4=0;
volatile int32_t capture3=0, capture3_prev=0, encoder3=0;

#define ADC_BUF_SIZE 256
volatile uint16_t ADCReadings[ADC_BUF_SIZE];
volatile int32_t adc_zero_amps = 2048;
volatile int32_t adc_accum = 0;

volatile uint32_t useconds=0, useconds_prev=0, time_of_start=0;
volatile int32_t cart_position=0, cart_position_prev=0;
volatile float targetX=0, dtargetX=0.0004;

// UNCOMMENT ONE OF THESE:
// parameter-based estimation
#define PEBO
// simplified GESO for PLvCC
//#define KKL

#if defined PEBO
volatile float hatX=0, hatQ=0, hatLPX=0, hatLPQ=0;
#elif defined KKL
const float gainX = -7.;
const float gainQ = -2.;
volatile float ZX=0, ZQ=0;
#endif

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_DAC_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM6_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

#if 1
uint32_t hal_ticks_us(void) {
	uint32_t prim;
	prim = __get_PRIMASK();
	__disable_irq();

	uint32_t counter1 = SysTick->VAL;
	uint32_t millis1 = HAL_GetTick();
	uint32_t counter2 = SysTick->VAL;
	uint32_t millis2 = HAL_GetTick();
	uint32_t counter3 = SysTick->VAL;

	if (!prim) {
		__enable_irq();
	}

	if (counter1>counter2)	{ // no reload while reading millis1
		return millis1*1000L + (23999-counter1)/24;
	}
	if (counter3>counter2) // is not supposed to happen
		while (1);
	return millis2*1000L + (23999-counter3)/24;
}
#else
uint32_t hal_ticks_us(void) {
	uint32_t prim;

	// Read PRIMASK register, check interrupt status before you disable them
	// Returns 0 if they are enabled, or non-zero if disabled
	prim = __get_PRIMASK();

	// Disable interrupts
	__disable_irq();
   (void) SysTick->CTRL;
	uint32_t counter = SysTick->VAL;
	uint32_t milliseconds = HAL_GetTick();
	uint32_t status = SysTick->CTRL;

	// Enable interrupts back only if they were enabled before we disable it here in this function
	if (!prim) {
		__enable_irq();
	}

	// It's still possible for the countflag bit to get set if the counter was
	// reloaded between reading VAL and reading CTRL. With interrupts  disabled
	// it definitely takes less than 50 HCLK cycles between reading VAL and
	// reading CTRL, so the test (counter > 50) is to cover the case where VAL
	// is +ve and very close to zero, and the COUNTFLAG bit is also set.
	if ((status & SysTick_CTRL_COUNTFLAG_Msk) && counter > 50) {
		// This means that the HW reloaded VAL between the time we read VAL and the
		// time we read CTRL, which implies that there is an interrupt pending
		// to increment the tick counter.
		milliseconds++;
	}
	uint32_t load = SysTick->LOAD;
	counter = load - counter; // Convert from decrementing to incrementing

	// ((load + 1) / 1000) is the number of counts per microsecond.
	//
	// counter / ((load + 1) / 1000) scales from the systick clock to microseconds
	// and is the same thing as (counter * 1000) / (load + 1)
	return milliseconds * 1000 + (counter * 1000) / (load + 1);
}
#endif

int32_t get_cart_position() {
    return encoder4*18L; // microns, #ticks*(36 teeth * 0.002m pitch)/(1000 ticks/rev * 4x) gives meters, multiplying it by 10^6 we get microns
}

