ssloy/mathfun/CartPendulum/src/STM32VLDISCOVERY/Src/main.c
int32_t get_pendulum_angle() {
    return (encoder3-4000)*45L; // millidegrees, #ticks * 360 / (2000 ticks/rev * 4x) gives degrees
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM6) {
    // handle eventual overflows in the encoder reading
    capture4 = TIM4->CNT;
    encoder4 += capture4 - capture4_prev;
    if (labs(capture4 - capture4_prev) > 32767) {
      encoder4 += (capture4 < capture4_prev ? 65535 : -65535);
    }
    capture4_prev = capture4;

    capture3 = TIM3->CNT;
    encoder3 += capture3 - capture3_prev;
    if (labs(capture3 - capture3_prev) > 32767) {
      encoder3 += (capture3 < capture3_prev ? 65535 : -65535);
    }
    capture3_prev = capture3;

    adc_accum = 0;
    for (uint16_t i = 0; i < ADC_BUF_SIZE; i++) {
      adc_accum += ADCReadings[i];
    }
    adc_accum /= ADC_BUF_SIZE;

    if (0 == system_task) {
      adc_zero_amps = adc_accum;
    }
  }
}

void set_current(float current_ref) {
  int32_t current = current_ref * 4095 / 3.;
  if (current > 0) {
    HAL_DAC_SetValue(&hdac, DAC_CHANNEL_1, DAC_ALIGN_12B_R, current);
    HAL_DAC_SetValue(&hdac, DAC_CHANNEL_2, DAC_ALIGN_12B_R, 0);
  } else {
    HAL_DAC_SetValue(&hdac, DAC_CHANNEL_1, DAC_ALIGN_12B_R, 0);
    HAL_DAC_SetValue(&hdac, DAC_CHANNEL_2, DAC_ALIGN_12B_R, -current);
  }
}

float get_current() {
  return (adc_accum - adc_zero_amps) / 4095.0 * 20.0;
}

/*
// frequencies are given in mHz
void chirp_current_open_loop(int16_t amplitude, int32_t start_freq, int32_t end_freq, int32_t duration_ms, FILE *uart_stream_ptr) {
    fprintf_P(uart_stream_ptr, PSTR("time(us),reference current(mA),current(mA),cart position(um),pendulum angle(mdeg)\r\n"));
    int32_t time_of_start, useconds;
    useconds = time_of_start = get_current_time();

    int32_t cart_position, pendulum_angle;
    int16_t current_ref, current_measured;
    while (useconds < time_of_start+duration_ms*1000L) {
        useconds = get_current_time();
        int32_t cur_ms = (useconds-time_of_start)/1000L;
        int32_t phi = ((start_freq + ((end_freq-start_freq)*cur_ms)/(2L*duration_ms))*cur_ms)/1000L; // период синусоиды равен тысяче единиц phi
        int32_t sine_idx = ((phi*512L)/1000L) & 0x1FF;
        current_ref = (sine(sine_idx)*(int32_t)(amplitude))/255L;
        current_measured = current(current_ref);

        cart_position = get_cart_position();
        pendulum_angle = get_pendulum_angle();

        fprintf_P(uart_stream_ptr, PSTR("%ld,%d,%d,%ld,%ld\r\n"), useconds, current_ref, current_measured, cart_position, pendulum_angle);
    }
    current(0);
}
*/
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM4_Init();
  MX_TIM3_Init();
  MX_USART1_UART_Init();
  MX_DAC_Init();
  MX_ADC1_Init();
  MX_TIM2_Init();
  MX_TIM6_Init();
  /* USER CODE BEGIN 2 */

  HAL_TIM_Base_Start_IT(&htim6);
  HAL_TIM_Encoder_Start(&htim3, TIM_CHANNEL_ALL);
  HAL_TIM_Encoder_Start(&htim4, TIM_CHANNEL_ALL);

  __HAL_DAC_ENABLE(&hdac, DAC_CHANNEL_1);
  __HAL_DAC_ENABLE(&hdac, DAC_CHANNEL_2);
  HAL_DAC_SetValue(&hdac, DAC_CHANNEL_1, DAC_ALIGN_12B_R, 0);
  HAL_DAC_SetValue(&hdac, DAC_CHANNEL_2, DAC_ALIGN_12B_R, 0);

  HAL_ADCEx_Calibration_Start(&hadc1);
  HAL_ADC_Start_DMA(&hadc1, (uint32_t*) ADCReadings, ADC_BUF_SIZE);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1) {
    cart_position_prev = cart_position;
    cart_position = get_cart_position();
    int32_t pendulum_angle = get_pendulum_angle();
    float current_measured = get_current();

    while (pendulum_angle > 180000)  pendulum_angle -= 360000; // mod 2pi
    while (pendulum_angle < -180000) pendulum_angle += 360000;

    useconds_prev = useconds;
    useconds = hal_ticks_us();

    float mesQ = pendulum_angle * 3.14159 / 180000.;  // radians
    float mesX = cart_position / 1000000.;          // meters

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
    if (1 == system_task) {
#if defined PEBO
      hatQ = mesQ;
      hatX = mesX;
#elif defined KKL
      ZQ = mesQ * gainQ;
      ZX = mesX * gainX;
#endif
      if (labs(pendulum_angle) < 5000L) {
        system_task = 2;
        time_of_start = useconds;
        char buff2[255] = "#time, current, target_x, x, q\r\n";
        HAL_UART_Transmit(&huart1, (uint8_t *) buff2, strlen(buff2), 3);
      }
    }

    if (2 == system_task) {
      const float Ki = 9.268;
      const float fricpos = 3.986 * .8;
      const float fricneg = -2.875 * .8;

      float u = current_measured * Ki;
      if (cart_position != cart_position_prev) {
        if (cart_position > cart_position_prev)
          u -= fricpos;
        else
          u -= fricneg;
      } else {
        if (u > 0) {
          if (u > fricpos)
            u -= fricpos;
          else
            u = 0;
        } else {
          if (u < fricneg)
            u -= fricneg;
          else
            u = 0;
        }
      }

      float dt = (useconds - useconds_prev) / 1000000.; // seconds

      float cosQ = cos(mesQ);
      float sinQ = sin(mesQ);

#if defined PEBO
      float A = 1./sqrtf(731.775 - 152.361*cosQ*cosQ);
      float hatDQ = (123.018*hatLPQ) * A;
      float hatDX = 0.933*hatLPX - (11.512*hatLPQ*cosQ) * A;
      float diffX = hatDX + 50*(mesX - hatX);
      float diffQ = 80*(mesQ - hatQ) + hatDQ;
      float diffLPX = 373.066*mesX - 373.066*hatX + .933*u + (4604.916*cosQ*(hatQ - mesQ)) * A;
      float diffLPQ = (18452.7315*(mesQ - hatQ) + 129.832*sinQ - 11.512*u*cosQ) * A;

      hatX += dt*diffX;
      hatQ += dt*diffQ;
      hatLPX += dt*diffLPX;
      hatLPQ += dt*diffLPQ;
#elif defined KKL
      float A = 1. / sqrtf(7.3178 - 1.5236 * cosQ * cosQ);
      float eX = ZX - gainX * mesX;
      float eQ = ZQ - gainQ * mesQ;

      float hatDQ = 12.3018 * eQ * A;
      float hatDX = 0.9327 * eX - 1.1512 * eQ * cosQ * A;

      float diffZQ = (12.9832 * sinQ - 1.1512 * u * cosQ) * A + gainQ * hatDQ;
      float diffZX = 0.9327 * u + gainX * hatDX;

      ZX += dt * diffZX;
      ZQ += dt * diffZQ;
#endif

      const float K[] = { 21.813858, 23.789165, 106.449942, 20.776078 };
      if (targetX > .2 || targetX < -.2)
        dtargetX = -dtargetX;
      targetX += dtargetX;

      int32_t f = K[0] * (mesX - targetX) + K[1] * (hatDX - dtargetX / 0.005) + K[2] * mesQ + K[3] * hatDQ; // Newtons

      float antifriction = 0;
      if (cart_position != cart_position_prev) {
        if (cart_position > cart_position_prev)
          antifriction = fricpos;
        else
          antifriction = fricneg;
      } else {
        if (fabs(f) > 0.01) {
          if (f > 0)
            antifriction = fricpos;
          else
            antifriction = fricneg;
        } else
          f = 0;
      }
      float current_ref = (f + antifriction) / Ki;
      if (current_ref > 3.3)
        current_ref = 3.3;
      if (current_ref < -3.3)
        current_ref = -3.3;

      set_current(current_ref);

      if (labs(cart_position) > 350000L || labs(pendulum_angle) > 30000L) {
        system_task = 9;
        set_current(0);
      }

      char buff[255] = { 0 };
      sprintf(buff, "%3.5f, %1.3f, %3.4f, %3.4f, %3.4f\r\n", (useconds - time_of_start) * 1e-6, u, targetX, mesX, mesQ);
      HAL_UART_Transmit(&huart1, (uint8_t *) buff, strlen(buff), 3);
    }
    while (hal_ticks_us() - useconds < 4900);
  }
  /* USER CODE END 3 */

